app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
    <option disabled>--please select album--</option>
    <% Album.all.each do |album| %>