app/views/users/show.html.erb

<ul>
  <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"