app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
    <option disabled>--please select band--</option>
    <% Band.all.each do |band| %>