app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "band_id", "year", "studio_album", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Modern Vampires of the City"], ["band_id", 1], ["year", 2013], ["studio_album", false], ["created_at", "2021-08-12 18:43:58.442587"], ["updated_at", "2021-08-12 18:43:58.442587"]]
---
  def create
    @album = Album.new(album_params)

    if @album.save!

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "studio_album" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["studio_album", true], ["updated_at", "2021-08-12 18:44:19.601298"], ["id", 2]]
---
  def update
    @album = Album.find(params[:id])
    @album.update(album_params)

SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 4]]
---
  def destroy
    @album = Album.find(params[:id])
    @band = @album.band
    @album.destroy!