app/controllers/bands_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Vampire Weekend"], ["updated_at", "2021-08-12 18:29:40.696507"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])
    @band.update(band_params)

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]
---
  def destroy
    @band = Band.find(params[:id])
    @band.destroy!