app/controllers/notes_controller.rb

INSERT INTO "notes" ("user_id", "track_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["track_id", 1], ["text", "I love this song!"], ["created_at", "2021-08-18 17:01:43.700418"], ["updated_at", "2021-08-18 17:01:43.700418"]]
---
  def create
    note = current_user.notes.new(note_params)
    note.save

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 3]]
---
  def destroy
    note = current_user.notes.find(params[:id])
    track = note.track
    note.destroy!