app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)

    if @track.save!
---
INSERT INTO "tracks" ("title", "ord", "lyrics", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Horchata"], ["ord", 1], ["lyrics", ""], ["album_id", 1], ["created_at", "2021-08-12 21:30:11.102962"], ["updated_at", "2021-08-12 21:30:11.102962"]]

  def update
    @track = Track.find(params[:id])
    @track.update(track_params)
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["lyrics", "In December drinking horchata, \r\nI look psychotic in a balaclava"], ["updated_at", "2021-08-18 20:29:21.936290"], ["id", 1]]

  def destroy
    @track = Track.find(params[:id])
    @album = @track.album
    @track.destroy!
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 3]]